app/controllers/api/v1/users_controller.rb

  def index
    render json: User.all
---
SELECT "users".* FROM "users"

  def create
    user = User.create(fruit_params)
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "asdasdasd"], ["password", "asdasdasd"], ["created_at", "2018-08-15 18:27:46.689222"], ["updated_at", "2018-08-15 18:27:46.689222"]]